/**
 * @Author:
 * @Description:
 * @File:  dict_test.go
 * @Date: 2021/5/11 8:14 下午
 */

package dict

import (
	"regexp"
	"testing"
	"time"
)

var worldsForTest1 []string = []string{"微信ALT", "这里不方便讲", "微信3568726", "需要了解加QQ", "vx", "wx", "威信", "微x", "v信", "wechat", "\\+v", "v\\+", "加v", "v\\：", "v\\:", "\\+微", "微\\:", "微\\：", "微芯搜索", "加他微搜索", "加她微搜索", "+V", "\\ 微", "v\\ ", "\\ v", "VX：", "WX：", "➕Ｖ", "加W", "+W", "加WX", "+WX", "加VX", "+VX", "加微信", "+微信", "加威信", "+威信", "葳信", "加葳信", "+葳信", "崴信", "加崴信", "+崴信", "薇信", "加薇信", "+薇信", "徽信", "加徽信", "+徽信", "微芯", "加微芯", "+微芯", "加微X", "+微X", "薇X", "加薇X", "+薇X", "威X", "加威X", "+威X", "徽X", "加徽X", "+徽X", "加V信", "+V信", "W信", "加W信", "+W信", "wei信", "加wei信", "+wei信", "加wechat", "+wechat", "weixin", "加weixin", "+weixin", "+微", "维信", "徽❤️ ：", "加我vx", "加我QQ", "加薇", "薇鑫", "hhlg-cz", "四零六九四九零", "肆零陆玖肆玖零", "b874573580", "xiu190127", "fei905994958", "qweasd1005", "zheng940908fen", "zhengrongrong530", "1/3802908205", "zengliying248280", "sd296850", "rongrong", "XXYKL520", "薇XXYKL520", "bwx099", "wawa095", "skok9912", "qq473294814", "d89145oo", "加一下薇", "zxcp122", "az036988", "jiaV", "w70703855", "zyfzs0829", "fch870520", "cjtp960414", "wwj123vb", "W199P199", "20973462", "bingniao321", "QH1681314", "huangjianbin1989", "GT8151", "yijian9002", "Aurora123456zw", "povo88", "+xin说", "ygcl0808", "二二凌三九", "y7758521yao", "B166Y166", "b188y188", "yushengang520", "xbsg2018", "2997172759", "JGXZ8888", "xuerong0414", "tb13", "tb13344", "微信社群", "喜欢的来谈", "电话联息", "机号", "上门收购", "互动联系", "二四时自动出价", "不到5分", "新产库自动上架", "TNND", "Vx", "WeiXin", "v+", "v：", "v:", "微:", "微：", "微♥", "胡景涛", "国家主席", "毛泽东主义", "毛泽东主义时代", "文化大革命", "十年动乱", "群专办", "文宣队", "台国民党联党", "钓鱼岛", "蒙古大夫", "基地组织", "伊斯兰极端主义", "四人帮", "大跃进", "黑五类", "日清战争", "伪满洲国", "十字军东征", "蒋介石", "马英九", "陈水扁", "李登辉", "蔡英文", "蒋经国", "江泽民", "胡锦涛", "温家宝", "吴邦国", "贾庆林", "李长春", "贺国强", "周永康", "习照连", "习掌柜", "习贼", "习泽东", "习又任", "习续无限", "习檄文", "习万岁", "习屠夫", "习世凯", "习氏修宪", "习氏党章", "习三连", "习三丰", "习权", "习家王朝", "习国", "习朝", "习 个人独裁", "包子登基", "毛二世", "包子露宪", "袁大与袁二", "修宪 坐龙椅", "修宪 终身制", "修宪 终身执政", "修宪 政改欺世", "修宪 司机不换班", "修宪 黄袍加身", "修宪 皇帝梦", "修宪 独裁", "修宪 倒行逆施", "修宪 倒车", "修宪 称帝", "修宪 强行通过", "宪法 强行通过", "宪法 狗屎", "习近平 终身制", "习近平 终身执政", "习近平 终身在任", "习近平 千古一帝", "习近平 玉皇大帝", "习近平 内奸公贼", "习近平 皇权梦", "习近平 皇帝", "习近平 复辟", "习近平 独裁", "习近平 登基", "习近平 倒车", "习近平 倒退", "习近平 称帝", "习近平 袁世凯", "习近平 无限期领导", "习近平 恢复帝制", "XJP 终身制", "XJP 终身执政", "XJP 终身在任", "XJP 千古一帝", "XJP 玉皇大帝", "XJP 内奸公贼", "XJP 皇权梦", "XJP 皇帝", "XJP 复辟", "XJP 独裁", "XJP 登基", "XJP 倒车", "XJP 倒退", "XJP 称帝", "XJP 袁世凯", "XJP 无限期领导", "XJP 恢复帝制", "包子 修宪", "包子 终身制", "包子 终身执政", "包子 终身在任", "包子 千古一帝", "包子 玉皇大帝", "包子 内奸公贼", "包子 皇权梦", "包子 皇帝", "包子 复辟", "包子 独裁", "包子 登基", "包子 倒车", "包子 称帝", "包子 袁世凯", "包子 无限期领导", "包子 恢复帝制", "戊戌年祭", "xijiniping", "jinpingxi", "王妙强", "秃子", "秃狗", "秃鹰", "秀鹰", "凸鹰", "电狗火狗", "黄河牌玩具", "狗粮磨具", "双弹鼓", "浇筑母鸡", "钳子母鸡", "侧拉狗", "军品狗", "滑膛狗", "铅狗", "气狗", "线膛狗", "气动狗", "中握", "毒狗箭", "毒狗针", "5.5秃管", "麻醉镖", "折叠弩", "骚本", "警棍", "马刀", "拉刀", "绿皮管", "绿皮5.5", "成品燕尾", "眼镜蛇高压打气筒", "连发pp弹抢", "气吹抢", "吹枪", "吹箭", "细针阀", "手狗", "高压狗", "火吹", "火机吹", "灭火吹", "打猎", "柯尔特", "绿山管", "气枪", "气阀枪", "弹弓枪", "粉弹枪", "渔夫吹", "枪械构造图", "雷鸣度", "木托兔子", "WG左轮", "巴力野猫CS", "巴力掠夺者", "犀利狗腿", "化隆造", "黑龙B版", "g18狗", "kidd管子", "德国A1000", "利士通", "雕花1911", "名门BAHI气筒", "碗消", "能材吧", "GSM阻截器", "伞兵托", "缩喉", "利士通管", "FX角斗士", "小黑豹专卖", "锡锋牌", "花山FK", "大猫1200", "大象牌铜壳", "国狙", "恒压阀组装吹", "大毒蛇", "金属波箱", "机械瞄", "弹线管", "土猎狗瓦盖鼻", "滑膛兔", "无声猫", "王八盒子", "火帽", "带灯Y档", "APS怪兽", "内脏全套", "黄河牌", "内脏结构图", "森西大芽", "森西种子", "自杀", "快手5件", "3j改", "外轨道料", "原轨原密料", "克隆", "三剑改气", "飞草客商城", "熔铅炉", "打乌", "短鸡", "咕噜壶", "麻果", "冰麻果", "麻古", "冰麻", "补料", "weed叶子", "K2香料K3香料", "毒狗丸", "赌博药水", "镇静催眠药", "G水", "骚冰", "散冰", "啪针", "啪丸", "火在烧冰在跑", "冰壶", "陪溜猪", "lsd邮票", "燃料北极光", "北极臭鼬", "柠檬臭鼬", "毒药", "布鲁斯菠萝快车", "黎城筋", "御米壳", "黄绿牙签", "新疆麻烟", "捕狗药", "kushak柠檬", "大花猫捕狗药", "白粉妹", "冰妹", "客户资料", "业主名单", "cvv料", "砗磲", "犀牛角", "鹤顶红", "盔犀鸟", "羚羊角", "虎骨", "虎皮", "玳瑁", "熊牙", "大猫骨", "红珊瑚", "剑齿虎", "苏晓康", "王鲁湘", "夏骏", "赵紫阳", "人民不需要自由", "1990年的春天", "许章润", "吕嘉", "黎安友", "新反右", "告密", "新文革", "马毅仁", "任夏伟", "白夏", "河殇", "刘晓波文集", "近代史的堕落", "远东的线索", "东突厥斯坦：维吾尔人的真实世界", "国民党不想提、共产党不愿谈的中国近代史", "文化大革命：人民的历史1962-1976", "花自飘零鸟自呼", "往事并不如烟", "这样事和谁细讲", "伶人往事", "上海生与死", "不自由国度的自由人：刘晓波的生命与思想世界", "卑贱中国人", "1949及其后", "最后的“天朝”：毛泽东、金日成与中朝关系", "我在文革漩涡中", "戚本禹回忆录", "红太阳是怎样升起的", "历史笔记", "文革前的邓小平", "储安平传", "大江大海一九四九", "党史笔记：十二个春秋", "李锐回忆录", "许家屯回忆录", "晚年周恩来", "毛泽东的私人医生", "国家的囚徒", "沙卡洛夫（萨哈洛夫）回忆录", "牛鬼蛇神录", "文化大革命的起源", "墓碑-中国六十年代大饥荒纪实", "毛泽东最后革命", "文化大革命十年史", "革命造反年代：上海文革运动史稿", "香港《开放》杂志2012年10月号", "刘仲敬", "刘晓波", "章诒和", "郑念", "余杰", "张春娇", "聂元梓", "邓力群", "杨小凯", "马若德", "杨继绳", "麦光法夸尔（马若德）沈迈克", "高皋", "严家其", "李逊", "裸体", "裸女", "人体写真", "人体艺术", "人体模特", "张嘉应", "张加应", "陈力", "陈建华", "春宫", "性文化", "男女交合", "李国华", "陈剑飞", "袁飞阳", "羞羞手卷", "情趣内衣", "情趣用品", "国产北极熊", "防屏蔽隐形耳机", "笔式短信接收器", "专业删帖软件", "新坑", "走私", "第五套", "烈士", "革命烈士", "英雄烈士", "革命英烈", "民族英烈", "联拍在线", "藏拍苑", "鑒定師", "文拍厅", "拍拍堂", "艺享拍卖", "乐拍堂", "网易拍卖", "东家", "微库拍", "文玩迷", "阿里拍卖", "尚拍堂", "京东拍卖", "龘藏", "拍宠", "全民拍卖", "闲鱼", "库拍", "竹兰里", "茶叶第一拍", "艺术网拍卖网", "天天拍", "寻宝之旅", "收藏大论坛", "美玉秀秀", "收藏联盟", "华夏收藏", "说画", "掌拍艺术", "全民收藏", "掌物志", "文玩世家", "文玩客", "文玩天下", "赵涌在线", "嘉德在线", "艺易拍HIHEY", "雅昌兜藏", "北京匡时", "艺典中国", "掌上易拍", "艺是网拍", "荣宝斋微拍", "雅鉴", "大咖拍卖", "新浪收藏旗下", "鹏辉科技", "甄宝视界", "万物得志", "玩物得志", "龙巅藏品", "免费体验", "增粉", "增加粉丝", "全自动上拍", "甩手掌柜", "免-费-体-验", "mmp", "出价的24小出", "二十四小时出价", "托顶价", "托违约", "出价24小时", "一次1毛钱", "违约4毛钱", "自动上架", "二四时自动", "分钱一次", "违约不到1毛", "一键上拍", "一键增粉", "一键点赞", "自动出价顶价", "24小时自动出价", "自助出价", "自动出价", "机房24小时监控", "包月", "直播间点心", "业务价格表", "xxx直播间人气，点赞，粉丝，互动联系", "零佣金", "零管理费", "洗黑", "涉黄", "刷单", "操你", "王八", "尼玛", "不得好死", "王八操", "傻逼", "狗砸种", "草泥马", "煞笔", "瞎子", "脑残", "屌丝", "AV", "老子怕你不成", "淫荡", "二百五", "懂个屁", "我草拟大爷", "卧槽", "我操", "我草你大爷", "日你", "你丫的有病", "你有毛病", "草他妈", "操你妈", "操你大爷", "你妹", "死全家", "放屁", "放P", "去你的", "强奸", "玩蛋去", "你妈", "你麻痹", "蛋疼", "二逼", "傻帽", "大SB", "残废人", "聋子", "傻子", "呆子", "弱智", "智障", "屌炸天", "撕逼", "草/操", "TMD", "打飞机", "色诱", "骗子", "畜生", "有病", "消费者协会", "网警", "警察", "武警", "纳粹", "港独", "台独", "藏独", "最赚", "最大程度", "最奢侈", "最低级", "时尚最低价", "最时尚", "最聚拢", "最符合", "最舒适", "最先", "最先进科学", "最先进加工工艺", "最先享受", "最后一波", "最新科技", "最新科学", "全网第一", "销量第一", "排名第一", "第一品牌", "NO.1", "TOP.1", "全国第一", "仅此一次", "仅此一款", "全国X大品牌之一", "国家级产品", "全球级", "宇宙级", "世界级", "顶级工艺", "顶级享受", "首个", "独家配方", "全国首发", "全国销量冠军", "国家免检", "填补国内空白", "中国驰名", "国际品质", "王牌", "领袖品牌", "世界领先", "遥遥领先", "领导者", "创领品牌", "领先上市", "巨星", "掌门人", "与虚假有关", "史无前例", "前无古人", "超赚", "点击领奖", "恭喜获奖", "全民免单", "抢爆", "再不抢就没了", "不会更便宜了", "错过就没机会了", "万人疯抢", "全民疯抢", "全民抢购", "卖疯了", "几天几夜", "趁现在", "特惠趴", "购物大趴", "闪购", "品牌团", "精品团", "随时结束", "随时涨价", "马上降价", "中国驰名商标", "专家推荐", "质量免检", "无需国家质量检测", "免抽检", "领导人推荐", "机关推荐", "金牌店铺", "金牌商家", "史上最低价", "最新技术", "全网首家", "全国首家", "xxx独家", "xxx首发", "免检", "国家领导人推荐", "国家机关推荐", "领取奖品", "不会再便宜了", "没有他就XX", "加微", "支那", "对庄", "香烟", "万能", "习主席", "刁主席", "刁包子", "近平", "习dd", "习近ping", "测试钞", "加我Q", "744689821", "垃圾货", "加我微信", "微信"}
var worldsForTitle []string = []string{"泸州老窖", "习近平", "习大大", "张德江", "李克强", "俞正声", "刘云山", "王岐山", "张高丽", "习特勒", "习皇", "习帝", "习大帝", "邓小平", "刁大", "刁大大", "刁近平", "习同志", "栗战书", "汪洋", "王沪宁", "赵乐际", "韩正", "丁薛祥", "王晨", "刘鹤", "许其亮", "孙春兰", "李希", "李强", "李鸿忠", "杨洁篪", "杨晓渡", "张又侠", "陈希", "陈全国", "陈敏尔", "胡春华", "郭声琨", "黄坤明", "蔡奇", "尤权", "出土", "范曾", "沈鹏", "苏士澍", "韩美林", "释永信", "莫言", "赵本山", "成龙", "唐寅", "吴湖帆", "吴冠中", "王成喜", "傅抱石", "启功", "许麟庐", "张海", "何家英", "齐白石", "赵忠祥", "习", "刁", "xi", "ping", "大大", "刁同志", "習", "習同志", "习仲勋", "習仲勋", "稀近平", "曦近平", "兮近平", "嘻近平", "析近平", "昔近平", "汐近平", "奚近平", "玺近平", "禧近平", "膝近平", "晰近平", "铣近平", "媳近平", "熹近平", "硒近平", "烯近平", "嚼近平", "腺近平", "羲近平", "犀近平", "茜近平", "晞近平", "郗近平", "嬉近平", "浠近平", "皙近平", "蜥禁评", "习禁平", "習禁平", "习进平", "習进平", "习金平", "習金平", "習尽平", "习筋平", "習筋平", "习晋平", "習晋平", "习進平", "習進平", "习紧平", "習紧平", "习斤平", "習斤平", "习今平", "習今平", "习劲平", "習劲平", "习仅平", "習仅平", "习锦平", "習锦平", "习津平", "習津平", "习瑾平", "習瑾平", "习靳平", "習靳平", "习巾平", "習巾平", "习浸平", "習浸平", "习谨平", "習谨平", "习襟平", "習襟平", "习烬平", "習烬平", "习妗平", "習妗平", "习董平", "習堇平", "习槿平", "習槿平", "习缙平", "習缙平", "习矜平", "習矜平", "习衿平", "習衿平", "习噤平", "習噤平", "习近贫", "習近品", "习近拼", "習近拼", "習近频", "习近聘", "習进聘", "习近嫔", "習近嫔", "习近姘", "習近姘", "习近榀", "習近榀", "习近顰", "習近颦", "习近牝", "習近牝", "习近蘋", "習近蘋", "习近玭", "習近玭", "习近貧", "習近貧", "习近噸", "習近嗍", "习近檳", "習近檳", "习近萍", "習近萍", "习近鲆", "習近鲆", "习近瓶", "習近瓶", "习近评", "習近评", "习近屏", "習近屏", "习近凭", "習近凭", "习近坪", "習近坪", "习近苹", "習近苹", "习近娉", "智近娉", "习近乒", "習近乒", "习近枰", "習近枰", "习近呷", "習近呷", "习近冯", "習近冯", "尽贫", "洗近贫", "洗井平", "席禁评", "叨近平", "叼近平主蓆", "习贱平", "习禁屏", "习禁评", "习钱平", "习忻平", "习狗平", "习猪平", "吸精瓶", "吸一精瓶", "习禁瓶", "习净贫", "洗茎瓶", "羽近平", "细菌平", "媳禁平", "刁禁评", "洗尽贫", "习屏禁", "屎近平", "屎进瓶", "刁平平", "西狗平", "西禁评", "西金评", "西金贫", "西静瓶", "席近瓶", "席近评", "席近贫", "席尽平", "席尽瓶", "席尽萍", "席晋平", "席禁平", "習井平", "習净贫", "習犬平", "習狗平", "習猪平", "習禁瓶", "習精平", "習金贫", "習静瓶", "西近瓶", "西尽平", "洗尽屏", "细近瓶", "习金贫", "习静屏", "叼禁评", "x金瓶", "xjin平", "xi尽萍", "xi金瓶", "刁近屏", "刁禁屏", "苁贱评", "刁金屏", "刁金评", "叼禁平", "习尽屏", "习金屏", "习金萍", "x近平", "包近平", "包子近平", "某近平", "习j评", "习井平", "习净瓶", "习尽评", "习禁贫", "习静瓶", "ⅹ禁评", "刁近瓶", "刁近贫", "刁j平", "刁尽瓶", "刁狗平", "刁禁贫", "包子禁评", "包子精瓶", "半羽精瓶", "吸近贫", "吸j瓶", "愛尽贫", "某禁评", "洗近瓶", "洗jin平", "洗jn贫", "洗净平", "洗净贫", "洗禁评", "洗禁贫", "洗茎爭", "羽尽平", "习禁萍", "刁尽萍", "吸近萍", "洗近萍", "羽近萍", "羽净贫", "煮习", "煮席", "习七帝", "习后主", "习皇帝", "习叔", "习爹", "习梦帝", "羽大大", "庆丰胖子", "刁泽东", "刁煮", "刁庆丰", "包撒币", "刁胖子", "大傻习", "习大傻", "刁胖", "刁二胖", "刁三胖", "半羽", "习黄帝", "刁帝", "习玄宗", "习始皇", "撒钱帝", "习脑残", "习大", "习匪", "习主官", "习呆子", "习二", "习二逼", "习儿子", "习干爹", "习败家", "习装逼", "习达达", "习鞑靼", "习傻傻", "习正恩", "习总今上", "习今上", "习巨巨", "包援外", "撒币帝", "刁近", "习犬", "包子", "习末君", "习哀宗", "无耻习胖", "习胖", "习无耻", "习天下", "习竹席", "习吾皇", "习包包", "刁总", "刁皇", "刁圣上", "刁狗", "刁刁", "包子帝", "歪脖习", "习远凸", "习猪", "习狗", "习胖胖", "习大林", "xi总", "习援外", "今上", "习禁禁", "刁习羽", "习蒋", "习金", "毛习泽东", "习毛泽东", "习打打", "習煮", "習爹", "習牛b", "细牛逼", "習牛逼", "習狗", "席猪", "習猪", "習的脑残", "希皇帝", "包子禁禁", "席core", "習七帝", "xi三胖", "xi主席", "叼主席", "媳主席", "屎主席", "希主席", "席主席", "细主席", "西主席", "苁万岁", "習万岁", "習主席受伤", "席受伤", "x竹席", "刁竹席", "竹席习", "某羽党", "習二逼", "習傻傻", "習儿子", "希元首", "習元首", "習包包", "xi包子", "媳包子", "習包子", "西包子", "習匪", "習叔", "叼同志", "xi吾皇", "包子吾皇", "習吾皇", "吾皇习", "屎吾皇万岁", "習吾皇万岁", "習呆呆", "西呆呆", "習永康", "習玄宗", "喉舌习", "喉舌帝", "庆丰嘉庆", "習土匪", "习圣上", "x圣上", "包子圣上", "屎圣上", "希圣上", "席圣上", "庆丰圣上", "洗圣上", "羽圣上", "習圣上", "西圣上", "圣上习", "圣上帝", "習大", "xi大傻", "刁大傻", "包子大傻", "希大傻", "習大傻", "xi大包子", "习内阁", "习交权", "习明折", "汉奸习", "习梦斯", "习元年", "肥仔习", "薄习争", "袭明泽", "西特勒", "西大大", "西撒钱", "近习平", "造神习", "刁近千", "叼近平", "夕近平", "近平哥", "近平为", "刃近平", "勺近乒", "勺近凭", "勺近坪", "勺近屏", "勺近平", "勺近枰", "勺近瓶", "勺近苹", "勺近萍", "勺近评", "習近矉", "匀近平", "习近品", "習近贫", "吸精屏", "xi狗萍", "刁精平", "包禁评", "屎包子", "希包子", "星云", "李文亮", "野生鹿", "黄喉", "黑颈", "徐悲鸿", "张大千", "黄宾虹", "黄颌水龟", "小头金龟", "克蛇龟", "三线龟", "三线闭壳龟", "金钱龟", "金头龟", "红边龟", "川字背龟", "红肚龟", "南石龟", "南石公龟", "南石母龟", "小青龟", "小青公龟", "小青母龟", "斑点池", "黑池公龟", "黑池母龟", "鲍贤伦", "吴昌硕", "潘天寿", "任伯年", "李苦禅", "李可染", "刘奎龄", "刘继卣", "海洛因", "文物", "倒斗", "陆肆", "民国78年", "民國78年", "鄧小平", "吾尔开希", "省领导", "周江勇", "车俊", "袁家军", "郑栅洁", "陈金彪", "冯飞", "朱国贤", "许罗德", "黄建发", "熊建平", "王昌荣", "冯文平", "陈伟俊", "野生兰", "野生石斛", "下山石斛", "野生香樟", "野生重楼", "野生天麻", "野生白及", "野生白芨", "野生山慈菇", "野生冰球子", "下山毛慈菇", "下山独蒜兰", "野生山芋头", "细粉", "史国良", "大猫（虎骨）", "戴帽", "甲片", "犀角", "鳞片", "dm（玳瑁）", "黑塑料（藏羚羊）", "角雕sj（赛加羚羊）", "老牙（象牙）", "摸金（穿山甲指甲）", "像牙（海象牙）", "461（象牙）", "xi牛角", "xj（犀角）", "白塑料（藏羚羊角、玳瑁、海象牙、盔犀鸟、抹香鲸牙、象皮、象牙）", "大喵骨（虎钩）", "独角（独角鲸牙）", "老窖", "泸州老窖特曲", "泸州", "泸州老窖头曲", "国窖1573", "国窖", "二曲", "习书记", "齐心", "李奉三", "程虹", "林郑月娥", "占领中环", "江青", "王洪文", "张春桥", "姚文元", "陈伯达", "穿山甲", "象牙", "犀牛", "特供", "专供", "国宴特供", "国宴专用", "国宴专供", "人民大会堂专供", "人民大会堂特供", "人民大会堂专用", "政协用酒", "全国人大专用", "全国人大特供", "全国人大专供", "军队特供", "军队专供", "军队专用", "JD特供", "谷穗教会", "佳全教会", "伊琳教会", "城市希望教会", "锡安教会", "尊道教会", "耶和华教会", "新天地教会", "中兴教会", "涌泉教会", "中华福音教会", "好消息教会", "异象学校", "安息日教会", "圣经归正教会", "荣桂里教会", "基督之家教会", "活石教会", "仁爱教会", "守望教会", "秋雨圣约教会", "恩福教会", "北海晨星教会", "新名教会", "星火教会", "巡司顶教会", "房角石教会", "五桥和梁平的教会", "出坑", "海捞", "生坑", "熟坑", "坑货", "水坑", "青铜", "古瓷", "古瓦", "回流", "西王赏功", "淳化元宝", "接待", "VIP", "Vip", "vip", "招待", "军队", "人民大会堂", "全国人大", "军中茅台", "JD", "RMDHT", "ZXYJ", "QGRD", "GYZY", "国宴", "国礼酒", "国宾", "国酒", "专用", "内供", "用酒", "供酒", "内招酒", "jd", "rmdht", "zxyj", "qgrd", "gyzy", "沙图什", "shahtoosh", "长角羊", "可可西里", "藏羚羊", "建党100周年", "“光荣在党50年”纪念章", "光荣在党50年", "“中国共产党成立100周年”纪念钞", "建党100周年纪念钞", "建党100周年测试票", "“中国共产党成立100周年”纪念币", "建党一百周年", "“光荣在党五十年”纪念章", "光荣在党五十年", "“中国共产党成立一百周年”纪念钞", "建党一百周年纪念钞", "建党一百周年测试票", "“中国共产党成立一百周年”纪念币", "建党一佰周年", "“光荣在党伍十年”纪念章", "光荣在党伍十年", "“中国共产党成立一佰周年”纪念钞", "建党一佰周年纪念钞", "建党一佰周年测试票", "“中国共产党成立一佰周年”纪念币", "建党壹佰周年", "“光荣在党伍拾年”纪念章", "光荣在党伍拾年", "“中国共产党成立壹佰周年”纪念钞", "建党壹佰周年纪念钞", "建党壹佰周年测试票", "“中国共产党成立壹佰周年”纪念币", "藏L羊", "藏红L羊", "藏红羊", "三星堆"}

func TestDict_Validate(t *testing.T) {
	type fields struct {
		trie  *Trie
		Index *Index
		noise *regexp.Regexp
	}
	type args struct {
		text string
	}
	tests := []struct {
		name   string
		fields fields
		args   args
		want   bool
		want1  string
	}{
		{
			name: "直播 context",
			fields: fields{
				trie: NewTrie(),
				Index: &Index{
					Describe: "直播",
					Name:     "live",
					Time:     time.Now().Unix(),
				},
				noise: regexp.MustCompile(`[\|\s&%$@*]+`),
			},
			args:  args{text: "wpt敏感词测试这里不方便讲拍卖玛瑙，我是一句不正常的话"},
			want:  false,
			want1: "这里不方便讲",
		},
		{
			name: "直播 2 title",
			fields: fields{
				trie: NewTrie(),
				Index: &Index{
					Describe: "直播",
					Name:     "live",
					Time:     time.Now().Unix(),
				},
				noise: regexp.MustCompile(`[\|\s&%$@*]+`),
			},
			args:  args{text: "纯手工海南黄花梨，介意勿拍！"},
			want:  true,
			want1: "",
		},

		{
			name: "直播 3 title",
			fields: fields{
				trie: NewTrie(),
				Index: &Index{
					Describe: "直播",
					Name:     "live",
					Time:     time.Now().Unix(),
				},
				noise: regexp.MustCompile(`[\|\s&%$@*]+`),
			},
			args:  args{text: "纯手工海南黄花梨，介意勿拍习近平！"},
			want:  false,
			want1: "习",
		},
	}

	tests[0].fields.trie.Add(worldsForTest1...)
	tests[1].fields.trie.Add(worldsForTitle...)
	tests[2].fields.trie.Add(worldsForTitle...)

	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			d := &Dict{
				trie:  tt.fields.trie,
				Index: tt.fields.Index,
				noise: tt.fields.noise,
			}
			got, got1 := d.Validate(tt.args.text)
			if got != tt.want {
				t.Errorf("Validate() got = %v, want %v", got, tt.want)
			}
			if got1 != tt.want1 {
				t.Errorf("Validate() got1 = %v, want %v", got1, tt.want1)
			}
		})
	}
}

func TestDict_Replace(t *testing.T) {
	type fields struct {
		trie  *Trie
		Index *Index
		noise *regexp.Regexp
	}
	type args struct {
		text string
		repl rune
	}
	tests := []struct {
		name   string
		fields fields
		args   args
		want   string
	}{
		{
			name: "直播 context",
			fields: fields{
				trie: NewTrie(),
				Index: &Index{
					Describe: "直播",
					Name:     "live",
					Time:     time.Now().Unix(),
				},
				noise: regexp.MustCompile(`[\|\s&%$@*]+`),
			},
			args: args{text: "xxx敏感词测试这里不方便讲拍卖玛瑙，我是一句不正常的话", repl: '*'},
			want: "xxx敏感词测试******拍卖玛瑙，我是一句不正常的话",
		},
		{
			name: "直播 2 title",
			fields: fields{
				trie: NewTrie(),
				Index: &Index{
					Describe: "直播",
					Name:     "live",
					Time:     time.Now().Unix(),
				},
				noise: regexp.MustCompile(`[\|\s&%$@*]+`),
			},
			args: args{text: "纯手工海南黄花梨，介意勿拍！", repl: '*'},
			want: "纯手工海南黄花梨，介意勿拍！",
		},

		{
			name: "直播 3 title",
			fields: fields{
				trie: NewTrie(),
				Index: &Index{
					Describe: "直播",
					Name:     "live",
					Time:     time.Now().Unix(),
				},
				noise: regexp.MustCompile(`[\|\s&%$@*]+`),
			},
			args: args{text: "纯手工海南黄花梨，介意勿拍习近平！", repl: '*'},
			want: "纯手工海南黄花梨，介意勿拍***！",
		},
	}
	tests[0].fields.trie.Add(worldsForTest1...)
	tests[1].fields.trie.Add(worldsForTitle...)
	tests[2].fields.trie.Add(worldsForTitle...)
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			d := &Dict{
				trie:  tt.fields.trie,
				Index: tt.fields.Index,
				noise: tt.fields.noise,
			}
			if got := d.Replace(tt.args.text, tt.args.repl); got != tt.want {
				t.Errorf("Replace() = %v, want %v", got, tt.want)
			}
		})
	}
}
